---
kind: property
id: P:Autodesk.Revit.DB.ImportInstance.IsLinked
source: html/21675a66-3412-795d-8f44-d54f2e4f74c7.htm
---
# Autodesk.Revit.DB.ImportInstance.IsLinked Property

Identifies whether this instance is a linked object rather than imported one.

## Syntax (C#)
```csharp
public bool IsLinked { get; }
```

## Remarks
True if the instance was imported as a link to an external file.
False if the instance was imported as a copy of data from an external file.